<a href="https://www.kaggle.com/code/bunniebytes/ctd-assignment-5?scriptVersionId=288663234" target="_blank"><img align="left" alt="Kaggle" title="Open in Kaggle" src="https://kaggle.com/static/images/open-in-kaggle.svg"></a>

In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import warnings

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/international-football-results-from-1872-to-2017/former_names.csv
/kaggle/input/international-football-results-from-1872-to-2017/goalscorers.csv
/kaggle/input/international-football-results-from-1872-to-2017/shootouts.csv
/kaggle/input/international-football-results-from-1872-to-2017/results.csv

## Task 1: Data Selection

In [2]:
# Part 1
data1 = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 30],
    'Salary': [50000, 60000, 70000, 80000, 55000]
}

data2 = {
    'Name': ['Frank', 'Grace', 'Helen', 'Ian', 'Jack'],
    'Age': [28, 33, 35, 29, 40],
    'Salary': [52000, 58000, 72000, 61000, 85000]
}

data3 = {
    'Name': ['Frank', 'Helen', 'Ian', 'Hima', 'Chaka'],
    'Age': [17, 93, 12, 57, 106],
    'Favorite Color': ['blue', 'pink', 'burgundy', 'red', 'turquoise']
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

display(df1)
display(df2)
display(df3)

# Part 2
print(df1["Name"])
print(df1[["Name", "Salary"]])
print(df1.iloc[0:3])

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000
4      Eva   30   55000

    Name  Age  Salary
0  Frank   28   52000
1  Grace   33   58000
2  Helen   35   72000
3    Ian   29   61000
4   Jack   40   85000

    Name  Age Favorite Color
0  Frank   17           blue
1  Helen   93           pink
2    Ian   12       burgundy
3   Hima   57            red
4  Chaka  106      turquoise

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object
      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
3    David   80000
4      Eva   55000
      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

## Task 2: Data Aggregation

In [3]:
df1_by_age = df1.groupby("Age").agg(mean = ("Salary", "mean"), salary_sum = ("Salary", "sum"), count = ("Salary", "count"))
display(df1_by_age)

        mean  salary_sum  count
Age
25   50000.0       50000      1
30   57500.0      115000      2
35   70000.0       70000      1
40   80000.0       80000      1

## Task 3: Merging and Joining DataFrames

In [4]:
# Part 1
warnings.filterwarnings('ignore')
df_1_3_merged = pd.merge(df1, df3, on = "Name", how = "outer", suffixes=['_left','_right'])
display(df_1_3_merged)

df_1_3_merged = df_1_3_merged.fillna({"Salary" : 15000, "Favorite Color" : "yellow"})
display(df_1_3_merged)

df_1_3_merged['Age'] = np.where(df_1_3_merged['Age_left'].notna(),df_1_3_merged['Age_left'], df_1_3_merged['Age_right'])
display(df_1_3_merged)

df_1_3_merged.drop(labels = ["Age_left", "Age_right"], axis = 1, inplace = True)
display(df_1_3_merged)

# Part 2
df1_b = df1.copy().set_index("Name")
df3_b = df3.copy().set_index("Name")
joined_df1_df3 = df1_b.join(df3_b, on = "Name", how = "outer", lsuffix='_left', rsuffix='_right')
display(joined_df1_df3)

      Name  Age_left   Salary  Age_right Favorite Color
0    Alice      25.0  50000.0        NaN            NaN
1      Bob      30.0  60000.0        NaN            NaN
2    Chaka       NaN      NaN      106.0      turquoise
3  Charlie      35.0  70000.0        NaN            NaN
4    David      40.0  80000.0        NaN            NaN
5      Eva      30.0  55000.0        NaN            NaN
6    Frank       NaN      NaN       17.0           blue
7    Helen       NaN      NaN       93.0           pink
8     Hima       NaN      NaN       57.0            red
9      Ian       NaN      NaN       12.0       burgundy

      Name  Age_left   Salary  Age_right Favorite Color
0    Alice      25.0  50000.0        NaN         yellow
1      Bob      30.0  60000.0        NaN         yellow
2    Chaka       NaN  15000.0      106.0      turquoise
3  Charlie      35.0  70000.0        NaN         yellow
4    David      40.0  80000.0        NaN         yellow
5      Eva      30.0  55000.0        NaN         yellow
6    Frank       NaN  15000.0       17.0           blue
7    Helen       NaN  15000.0       93.0           pink
8     Hima       NaN  15000.0       57.0            red
9      Ian       NaN  15000.0       12.0       burgundy

      Name  Age_left   Salary  Age_right Favorite Color    Age
0    Alice      25.0  50000.0        NaN         yellow   25.0
1      Bob      30.0  60000.0        NaN         yellow   30.0
2    Chaka       NaN  15000.0      106.0      turquoise  106.0
3  Charlie      35.0  70000.0        NaN         yellow   35.0
4    David      40.0  80000.0        NaN         yellow   40.0
5      Eva      30.0  55000.0        NaN         yellow   30.0
6    Frank       NaN  15000.0       17.0           blue   17.0
7    Helen       NaN  15000.0       93.0           pink   93.0
8     Hima       NaN  15000.0       57.0            red   57.0
9      Ian       NaN  15000.0       12.0       burgundy   12.0

      Name   Salary Favorite Color    Age
0    Alice  50000.0         yellow   25.0
1      Bob  60000.0         yellow   30.0
2    Chaka  15000.0      turquoise  106.0
3  Charlie  70000.0         yellow   35.0
4    David  80000.0         yellow   40.0
5      Eva  55000.0         yellow   30.0
6    Frank  15000.0           blue   17.0
7    Helen  15000.0           pink   93.0
8     Hima  15000.0            red   57.0
9      Ian  15000.0       burgundy   12.0

            Name  Age_left   Salary  Age_right Favorite Color
Alice      Alice      25.0  50000.0        NaN            NaN
Bob          Bob      30.0  60000.0        NaN            NaN
NaN        Chaka       NaN      NaN      106.0      turquoise
Charlie  Charlie      35.0  70000.0        NaN            NaN
David      David      40.0  80000.0        NaN            NaN
Eva          Eva      30.0  55000.0        NaN            NaN
NaN        Frank       NaN      NaN       17.0           blue
NaN        Helen       NaN      NaN       93.0           pink
NaN         Hima       NaN      NaN       57.0            red
NaN          Ian       NaN      NaN       12.0       burgundy

## Task 4: Filtering Rows Based on Conditions

In [5]:
# Part 1
display(df1[df1["Age"] > 30])

      Name  Age  Salary
2  Charlie   35   70000
3    David   40   80000

## Task 5: Sorting Data

In [6]:
# Part 1
display(df1.sort_values(by = "Salary", ascending = False))

      Name  Age  Salary
3    David   40   80000
2  Charlie   35   70000
1      Bob   30   60000
4      Eva   30   55000
0    Alice   25   50000

## Task 6: Renaming Columns

In [7]:
# Part 1
df1_renamed = df1.rename(columns = {"Age" : "Employee Age", "Salary" : "Employee Salary"})
display(df1_renamed)

      Name  Employee Age  Employee Salary
0    Alice            25            50000
1      Bob            30            60000
2  Charlie            35            70000
3    David            40            80000
4      Eva            30            55000

## Task 7: Data Transformation

In [8]:
# Part 1
df1["Salary"] = df1["Salary"] * 1.1
display(df1)

      Name  Age   Salary
0    Alice   25  55000.0
1      Bob   30  66000.0
2  Charlie   35  77000.0
3    David   40  88000.0
4      Eva   30  60500.0

## Task 8: Concatenating DataFrames

In [9]:
df1 = pd.concat([df1, df2], ignore_index=True)
display(df1)

      Name  Age   Salary
0    Alice   25  55000.0
1      Bob   30  66000.0
2  Charlie   35  77000.0
3    David   40  88000.0
4      Eva   30  60500.0
5    Frank   28  52000.0
6    Grace   33  58000.0
7    Helen   35  72000.0
8      Ian   29  61000.0
9     Jack   40  85000.0

## Task 9: Data Wrangling a Kaggle Dataset

In [10]:
football_results = pd.read_csv("/kaggle/input/international-football-results-from-1872-to-2017/results.csv")
print(football_results.head())

results_1 = football_results[["home_team", "away_team", "home_score", "away_score", "date"]]
print(results_1.head())

results_2 = results_1.rename(columns = {"home_team" : "team", "away_team" : "opponent", "home_score" : "points_for", "away_score" : "points_against"})
print(results_2.head())

results_3 = results_1.rename(columns = {"away_team" : "team", "home_team" : "opponent", "away_score" : "points_for", "home_score" : "points_against"})
# print(results_3.head())
print(results_3.head())

football_results = pd.concat([results_2, results_3], ignore_index = True)
print(football_results.head())

points_against = football_results.groupby("team")["points_against"].mean()

sorted_points_against = points_against.sort_values(ascending = False)
print(sorted_points_against.head(10))

         date home_team away_team  home_score  away_score tournament     city  \
0  1872-11-30  Scotland   England           0           0   Friendly  Glasgow
1  1873-03-08   England  Scotland           4           2   Friendly   London
2  1874-03-07  Scotland   England           2           1   Friendly  Glasgow
3  1875-03-06   England  Scotland           2           2   Friendly   London
4  1876-03-04  Scotland   England           3           0   Friendly  Glasgow

    country  neutral
0  Scotland    False
1   England    False
2  Scotland    False
3   England    False
4  Scotland    False
  home_team away_team  home_score  away_score        date
0  Scotland   England           0           0  1872-11-30
1   England  Scotland           4           2  1873-03-08
2  Scotland   England           2           1  1874-03-07
3   England  Scotland           2           2  1875-03-06
4  Scotland   England           3           0  1876-03-04
       team  opponent  points_for  points_against        date
0  Scotland   England           0               0  1872-11-30
1   England  Scotland           4               2  1873-03-08
2  Scotland   England           2               1  1874-03-07
3   England  Scotland           2               2  1875-03-06
4  Scotland   England           3               0  1876-03-04
   opponent      team  points_against  points_for        date
0  Scotland   England               0           0  1872-11-30
1   England  Scotland               4           2  1873-03-08
2  Scotland   England               2           1  1874-03-07
3   England  Scotland               2           2  1875-03-06
4  Scotland   England               3           0  1876-03-04
       team  opponent  points_for  points_against        date
0  Scotland   England           0               0  1872-11-30
1   England  Scotland           4               2  1873-03-08
2  Scotland   England           2               1  1874-03-07
3   England  Scotland           2               2  1875-03-06
4  Scotland   England           3               0  1876-03-04
team
Sark                         17.500000
Niue                         16.500000
Darfur                       14.142857
Kiribati                     11.454545
Saint Pierre and Miquelon    11.142857
Palau                        10.500000
Chechnya                      9.666667
Ryūkyū                        9.000000
Micronesia                    8.428571
American Samoa                6.528302
Name: points_against, dtype: float64

## Task 10: More Data Wrangling for Football Results

In [11]:
tunisia_results = football_results[football_results["team"] == "Tunisia"].sort_values(by = "date", ascending = False)
display(tunisia_results.head(10))

          team               opponent  points_for  points_against        date
97767  Tunisia                  Qatar           3               0  2025-12-07
97759  Tunisia              Palestine           2               2  2025-12-04
48860  Tunisia                  Syria           0               1  2025-12-01
97715  Tunisia                 Brazil           1               1  2025-11-18
48744  Tunisia                 Jordan           3               2  2025-11-14
48703  Tunisia             Mauritania           1               1  2025-11-12
48651  Tunisia                Namibia           3               0  2025-10-13
48605  Tunisia  São Tomé and Príncipe           6               0  2025-10-10
97380  Tunisia      Equatorial Guinea           1               0  2025-09-08
48414  Tunisia                Liberia           3               0  2025-09-04